artillery-critical-endpoints.yml
config:
  target: "http://localhost"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
  defaults:
    headers:
      Content-Type: "application/json"
scenarios:
  # Load balanced test via Traefik (port 80)
  - name: "Load Balanced API Test"
    flow:
      - get:
          url: "/api/inventory"
      - post:
          url: "/api/inventory"
          json:
            nom: "Test Item"
            categorie: "TestCat"
            prix: 10.5
            stockCentral: 100
      - patch:
          url: "/api/inventory/1/stock/increase"
          json:
            quantity: 5
      - patch:
          url: "/api/inventory/1/stock/decrease"
          json:
            quantity: 2
      - post:
          url: "/api/transactions"
          json:
            personnelId: 1
            storeId: 1
            items:
              - id: 1
                quantity: 1
                price: 10.5
            montantTotal: 10.5
  # Optionally, test direct access to each instance (should not be accessible in prod, but for test)
  - name: "Direct API1 Test"
    flow:
      - get:
          url: "http://localhost:8080/api/inventory"
  - name: "Direct API2 Test"
    flow:
      - get:
          url: "http://localhost:8080/api/inventory"