artillery-critical-endpoints.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Steady load"
scenarios:
  - name: "Get all inventory items"
    flow:
      - get:
          url: "/api/inventory"
  - name: "Create inventory item"
    flow:
      - post:
          url: "/api/inventory"
          json:
            nom: "Test Item"
            categorie: "TestCat"
            prix: 10.5
            stockCentral: 100
  - name: "Increase stock"
    flow:
      - patch:
          url: "/api/inventory/1/stock/increase"
          json:
            quantity: 5
  - name: "Decrease stock"
    flow:
      - patch:
          url: "/api/inventory/1/stock/decrease"
          json:
            quantity: 2
  - name: "Create sale transaction"
    flow:
      - post:
          url: "/api/transactions"
          json:
            personnelId: 1
            storeId: 1
            items:
              - id: 1
                quantity: 1
                price: 10.5
            montantTotal: 10.5